{"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "Lambda", "config": {"name": "lambda", "trainable": true, "batch_input_shape": [null, 64, 64, 1], "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAQAAAATAAAAcxIAAAB0AGoBagJ8AIgAiABmAoMCUwApAU4pA9oCdGbaBWlt\nYWdl2g1yZXNpemVfaW1hZ2VzKQFyAgAAACkB2gZyZXNpemWpAPo4L2hvbWUvcmF5ZWgvRGVza3Rv\ncC9Qcm9qZWN0L2FpeDM2MC9BSVgzNjAvc2V0dXBfY29kZWMucHnaCDxsYW1iZGE+EwAAAPMAAAAA\n", null, [64]], "function_type": "lambda", "module": "setup_codec", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}}, {"class_name": "Activation", "config": {"name": "activation", "trainable": true, "dtype": "float32", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2d", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}